Test result:
```
sandeeps@Sandeeps-MacBook-Pro custom_resolver % terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_dns_custom_resolver_location.test1 will be created
  + resource "ibm_dns_custom_resolver_location" "test1" {
      + cr_enabled    = true
      + dns_server_ip = (known after apply)
      + enabled       = true
      + healthy       = (known after apply)
      + id            = (known after apply)
      + instance_id   = "7e546232-d8e2-4c7f-b2d6-982c686c2908"
      + location_id   = (known after apply)
      + resolver_id   = "c079479d-1f93-443b-934a-ff7db54a6326"
      + subnet_crn    = "crn:v1:staging:public:is:us-south-2:a/772989cf1fe0c64bbee8d0dd38ec5c71::subnet:0726-d0fbf337-d98d-443c-97c7-1915bdd320c5"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ibm_dns_custom_resolver_location.test1: Creating...
╷
│ Warning: Deprecated Resource
│
│   with ibm_dns_custom_resolver_location.test1,
│   on cr_spectrum_scale.tf line 50, in resource "ibm_dns_custom_resolver_location" "test1":
│   50: resource "ibm_dns_custom_resolver_location" "test1" {
│
│ Resource ibm_dns_custom_resolver_location is deprecated. Using the deprecated resource can cause an outage. If you have used the `ibm_dns_custom_resolver_location` resource, change it to the
│ composite Custom Resolver [ibm_dns_custom_resolver] resource before running terraform apply.
│
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: Resource ibm_dns_custom_resolver_location is deprecated. Use the composite Custom Resolver resource[ibm_dns_custom_resolver], which can handle locations, instead.
│
│   with ibm_dns_custom_resolver_location.test1,
│   on cr_spectrum_scale.tf line 50, in resource "ibm_dns_custom_resolver_location" "test1":
│   50: resource "ibm_dns_custom_resolver_location" "test1" {
│
╵
```

Output from acceptance testing:

<img width="576" alt="image" src="https://user-images.githubusercontent.com/79745361/214232019-9d4f9c06-47af-4278-93f9-d505665785ec.png">

